document.addEventListener("DOMContentLoaded", function() {
    const urlParams = new URLSearchParams(window.location.search);
    const dish = urlParams.get('dish');
    
    if (dish) {
        const dishDetails = {
            dish1: {
                name: "黄焖鸡米饭",
                image: "images/dish1.jpg",
                price: "¥18",
                description: "黄焖鸡米饭以鸡肉为主料，配以土豆、胡萝卜和米饭，炖制而成。这道菜肴口感鲜嫩多汁，鸡肉入味，汤汁浓郁，适合与香喷喷的米饭一同享用。无论是冬日寒冷还是夏日酷热，黄焖鸡米饭都能让人感受到家的温暖和味道。是那种吃过一次就念念不忘的美味佳肴，让您每一口都感受到家的味道和温暖。"
            },
            dish2: {
                name: "五谷渔粉",
                image: "images/dish2.jpg",
                price: "¥15",
                description: "五谷渔粉，将新鲜的五谷杂粮与精选的海鲜相结合，是一道健康美味的汤粉。每一口都蕴含着丰富的营养和独特的风味。清爽的汤底搭配着米粉的细腻口感，再加上海鲜的鲜美，使得这道菜成为餐桌上的必点佳品。不论是冬日温暖，夏日清凉，五谷渔粉都能为您带来满满的满足感和愉悦的味觉体验，绝对是食堂里的一道亮点。"
            },
            dish3: {
                name: "拉面",
                image: "images/dish3.jpg",
                price: "¥10",
                description: "我们的特色拉面以新鲜手工制作的面条为基础，配以浓郁的牛骨汤底和精选的烤肉片，每一口都充满着鲜美和满足感。面条Q弹有嚼劲，汤汁鲜香浓郁，烤肉片则增添了风味和丰富的口感。这道拉面不仅味道出众，而且营养丰富，适合各个年龄层的顾客。无论是午餐还是晚餐，特色拉面都能为您带来一种温暖的满足感，成为食堂的人气之选。"
            },
            dish4: {
                name: "黑椒牛肉饭",
                image: "images/dish4.jpg",
                price: "¥10",
                description: "我们的香煎黑椒牛肉饭以精选的优质牛肉为主料，经过特制的黑椒酱汁烹饪，肉质鲜嫩多汁，带有深厚的黑椒香气。配以松软香气四溢的蒸饭，每一口都散发着独特的香味和浓烈的牛肉风味。这道菜色香味美，口感丰富，不仅能让您享受到美味，还能带来满足的饱腹感。香煎黑椒牛肉饭不仅适合快节奏的午餐时间，也是晚餐时分的绝佳选择，定能成为食堂的一大招牌菜品。"
            },
            dish5: {
                name: "烧鸭饭",
                image: "images/dish5.jpg",
                price: "¥10",
                description: "我们的香烤烧鸭饭采用优质鸭肉，经过传统的烤制工艺，肉质鲜嫩多汁，外皮烤得金黄酥脆。搭配上香气扑鼻的蒸饭，每一口都能感受到鸭肉的浓郁香味和烤制后的特别口感。这道菜品不仅味道独特，而且营养丰富，是一顿美味可口的正餐选择。香烤烧鸭饭不论是午餐还是晚餐，都能让您享受到满满的饱腹感和满足感，绝对是食堂里的一道亮点菜品。"
            },
            dish6: {
                name: "猪杂汤",
                image: "images/dish6.jpg",
                price: "¥13",
                description: "我们的滋补猪杂汤选用新鲜的猪肉和各种精心挑选的杂碎，经过长时间的熬制，汤汁浓郁鲜美。汤中不仅有猪肉的鲜香，还融入了各种杂碎的营养，口感丰富。每一口汤都带来温暖和满足，适合任何时候食用，尤其是在寒冷的冬季或者需要补充体力的时候。滋补猪杂汤不仅是一道美味的汤品，更是食堂中的一道营养佳肴，让您感受到家的温暖和食物的美好。"
            },
            dish7: {
                name: "麻辣烫",
                image: "images/dish7.jpg",
                price: "¥20",
                description: "我们的麻辣烫以其独特的口味和丰富的食材深受顾客喜爱。选用新鲜的肉类、蔬菜和各种配料，配以麻辣浓汤，香辣四溢，回味无穷。每一口都能感受到麻辣的独特风味，令人胃口大开。无论是冷冬中的暖胃良品，还是夏日里的开胃佳肴，麻辣烫都能为您带来满满的幸福感和满足感。"
            },
            dish8: {
                name: "咖喱牛肉",
                image: "images/dish8.jpg",
                price: "¥15",
                description: "我们的咖喱牛肉深受顾客喜爱，以浓郁的咖喱汁和鲜嫩的牛肉为特色。每一口都能品味到咖喱的香浓和牛肉的鲜美，口感丰富而不油腻。咖喱的独特风味与牛肉的鲜嫩完美融合，带给您舌尖上的美味享受。不论是单独享用还是搭配米饭，咖喱牛肉都是味蕾的绝佳选择，为您带来一场满足的美食之旅。"
            },
            dish9: {
                name: "螺蛳粉",
                image: "images/dish9.jpg",
                price: "¥18",
                description: "螺蛳粉，是一道源自湖南、广西等地的传统美食，以其浓厚的地方风味和独特的调料组合而闻名。我们的螺蛳粉选用新鲜的螺蛳和精心熬制的汤底，汤汁鲜美浓郁，口感丰富，配上细滑的粉条和丰富的配料，包括香菜、葱花和辣椒，每一口都能感受到浓浓的家乡味道。无论是作为早餐的选择还是作为午餐的一餐，螺蛳粉都能带给您纯正的地方美食体验。这款正宗的螺蛳粉不仅是味觉上的享受，更是对地方美食文化的一次致敬。希望您能尝试我们精心制作的螺蛳粉，享受来自南方的地道味道。"
            },
            dish10: {
                name: "椰汁西米露",
                image: "images/dish10.jpg",
                price: "¥10",
                description: "椰汁西米露是一道清凉爽口的甜品，以其细腻的口感和香浓的椰香而著称。我们的椰汁西米露选用新鲜的椰汁和优质的西米，配以适量的糖水，味道醇香甘甜。每一口都带着清新的椰香，入口即化的西米，给您带来一种愉悦的食物体验。这款甜品不仅适合作为饭后甜点，还是夏日清凉解暑的最佳选择。无论是在炎热的夏季还是寒冷的冬天，椰汁西米露都能为您带来一丝清凉和满足。欢迎您来品尝我们独特的椰汁西米露，让味蕾在香浓椰香中舒展开来。"
            },
            
            // 更多菜品详细信息
        };
        
        if (dishDetails[dish]) {
            document.getElementById('dish-name').innerText = dishDetails[dish].name;
            document.getElementById('dish-image').src = dishDetails[dish].image;
            document.getElementById('dish-description').innerText = dishDetails[dish].description;
            document.getElementById('dish-price').innerText = dishDetails[dish].price;
        }
    }
});
